Revit 2027 API
ExternalServices Class
Provides a container of all Revit built-in ExternalServiceId instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalService.ExternalServices
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalServices
Public NotInheritable Class ExternalServices
public ref class ExternalServices abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalServices = class end
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace